tutorials/heatTransfer/chtMultiRegionSimpleFoam/multiRegionHeater/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory


# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

rm -rf constant/polyMesh/sets

runApplication blockMesh
runApplication setSet -batch makeCellSets.setSet

rm -f constant/polyMesh/sets/*_old

runApplication setsToZones -noFlipMap
runApplication splitMeshRegions -cellZones -overwrite

# remove fluid fields from solid regions (important for post-processing)
for i in heater leftSolid rightSolid
do
   rm -f 0*/$i/{mut,alphat,epsilon,k,p,p,U}
done

# remove solid fields from fluid regions (important for post-processing)
for i in bottomAir topAir
do
   rm -f 0*/$i/{cp,Kappa,rho}
done

for i in bottomAir topAir heater leftSolid rightSolid
do
   changeDictionary -region $i > log.changeDictionary.$i 2>&1
done

# Symbolic links don't work on MS Windows so we make real copies
if [ "$WM_OSTYPE" = "MSWindows" ]
then
    echo "MSWindows detected -> we need to recreate symbolic links which will be actual copies of orginal files (MSWin does not support symbolic links)"
    # Symbolic links for bottomAir
    ln -sf "$PWD/system/topAir/fvSolution" "$PWD/system/bottomAir/fvSolution"
    ln -sf "$PWD/system/topAir/fvSchemes" "$PWD/system/bottomAir/fvSchemes"
    # Symbolic links for leftSolid
    ln -sf "$PWD/system/heater/fvSchemes" "$PWD/system/leftSolid/fvSchemes"
    ln -sf "$PWD/system/heater/fvSolution" "$PWD/system/leftSolid/fvSolution"
    # Symbolic links for rightSolid
    ln -sf "$PWD/system/heater/fvSchemes" "$PWD/system/rightSolid/fvSchemes"
    ln -sf "$PWD/system/heater/fvSolution" "$PWD/system/rightSolid/fvSolution"
fi

#-- Run on single processor
runApplication chtMultiRegionSimpleFoam

## Decompose
#for i in bottomAir topAir heater leftSolid rightSolid
#do
#   decomposePar -region $i > log.decomposePar.$i 2>&1
#done
#
## Run
#runParallel chtMultiRegionSimpleFoam 4
#
## Reconstruct
#for i in bottomAir topAir heater leftSolid rightSolid
#do
#   reconstructPar -region $i > log.reconstructPar.$i 2>&1
#done


echo
echo "creating files for paraview post-processing"
echo
for i in bottomAir topAir heater leftSolid rightSolid
do
   paraFoam -touch -region $i
done

# ----------------------------------------------------------------- end-of-file
